Revit 2027 API
BuiltInFailures.OverlapFailures.DuplicateRebar Property
 There are identical rebar in the same place. This will result in double counting in schedules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuplicateRebar { get; }
Public Shared ReadOnly Property DuplicateRebar As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuplicateRebar {
	FailureDefinitionId^ get ();
}
static member DuplicateRebar : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace